{"document": "WikipediaArticles_coref/AppleInc_coref.txt", "extraction": [{"template": "Buy", "sentence": "Apple swiftly returned to profitability under the revitalizing Think different campaign, as he rebuilt Apple's status by launching the iMac in 1998, opening the retail chain of Apple Stores in 2001, and acquiring numerous companies to broaden the software portfolio.", "arguments": {"item": "numerous companies"}}, {"template": "Buy", "sentence": "VisiCalc created a business market for The Apple II and gave home users an additional reason to buy an Apple II: compatibility with the office.", "arguments": {"item": "an Apple II"}}, {"template": "Buy", "sentence": "In May 2014, the company confirmed the company intent to acquire Dr. Dre and Jimmy Iovine's audio company Beats Electronics—producer of the \"Beats by Dr. Dre\" line of headphones and speaker products, and operator of the music streaming service Beats Music—for $3 billion, and to sell headphones and speaker products products through Apple's retail outlets and resellers.", "arguments": {"item": "Dr. Dre", "price": "$3 billion"}}, {"template": "Buy", "sentence": "Critics have claimed that Apple products combine stolen and/or purchased designs that Apple claims are Apple original creations.", "arguments": {"item": "designs"}}, {"template": "Buy", "sentence": "A software update released on January 15, 2008, allowed media to be purchased directly from the Apple TV.\n\n", "arguments": {"item": "media", "buyer": "the Apple TV"}}, {"template": "Buy", "sentence": "Apple features the Apple A5 processor and Siri voice assistant technology, the latter of which Apple had acquired in 2010.", "arguments": {"buyer": "Apple"}}, {"template": "Buy", "sentence": "Next, Apple successfully acquired the German company Astarte, which had developed DVD authoring technology, as well as Astarte's corresponding products and engineering team in April 2000.", "arguments": {"buyer": "Apple", "item": "the German company"}}, {"template": "Buy", "sentence": "In August 2018, Apple purchased Akonia Holographics for Apple augmented reality goggle lens.", "arguments": {"buyer": "Apple", "item": "Akonia Holographics"}}, {"template": "Buy", "sentence": "Xerox granted Apple engineers three days of access to the Xerox PARC facilities in return for the option to buy 100,000 shares (800,000 split-adjusted shares) of Apple at the pre-IPO price of $10 a share.\n\n", "arguments": {"item": "100,000 shares"}}, {"template": "Buy", "sentence": "In 1997, CEO Gil Amelio led Apple to buy NeXT, solving the desperately failed operating system strategy and bringing Jobs back.", "arguments": {"item": "NeXT"}}, {"template": "Buy", "sentence": "After numerous failed attempts to modernize Mac OS, first with the Pink project from 1988 and later with Copland from 1994, Apple in 1997 purchased NeXT for Apple NeXTSTEP operating system and to bring Steve Jobs back.\n", "arguments": {"buyer": "Apple", "item": "NeXT"}}, {"template": "Buy", "sentence": "In July 2001, Apple acquired Spruce Technologies, a PC DVD authoring platform, to incorporate Apple technology into Apple's expanding portfolio of digital video projects.\n\n", "arguments": {"buyer": "Apple", "item": "Spruce Technologies"}}, {"template": "Buy", "sentence": "In 2002, Apple purchased Nothing Real for Apple advanced digital compositing application Shake, as well as Emagic for the music productivity application Logic.", "arguments": {"buyer": "Apple", "item": "Nothing"}}, {"template": "Buy", "sentence": "An internal memo leaked in 2015 suggested the company planned to discourage long lines and direct customers to purchase the company products on the company website.\n\n", "arguments": {"item": "the company products"}}, {"template": "Buy", "sentence": "Towards the end of the year, TechCrunch reported that Apple was acquiring Shazam, a company specializing in music, TV, film and advertising recognition.", "arguments": {"buyer": "Apple", "item": "Shazam"}}, {"template": "Buy", "sentence": "In December 2015, Apple bought the 70,000-square-foot manufacturing facility in North San Jose previously used by Maxim Integrated, in an $18.2 million deal.\n", "arguments": {"buyer": "Apple", "item": "the 70,000-square-foot manufacturing facility"}}, {"template": "Buy", "sentence": "In 1998, Apple purchased Macromedia's Key Grip software project, signaling an expansion into the digital video editing market.", "arguments": {"buyer": "Apple", "item": "Macromedia's Key Grip software project"}}, {"template": "Buy", "sentence": "On February 14, 2019, Apple acquired DataTiger for Apple digital marketing technology.\n", "arguments": {"buyer": "Apple", "item": "DataTiger"}}, {"template": "Buy", "sentence": "The NeXT acquisition was finalized on February 9, 1997, bringing Jobs back to Apple as an advisor.", "arguments": {}}, {"template": "Buy", "sentence": "During this period, Apple completed numerous acquisitions to create a portfolio of digital production software for both professionals and consumers.", "arguments": {}}, {"template": "Buy", "sentence": "The acquisition was followed by the development of Apple's consumer-level GarageBand application.", "arguments": {}}, {"template": "Buy", "sentence": "The acquisition was the largest purchase in Apple's history.\n\n", "arguments": {}}, {"template": "Buy", "sentence": "The acquisition was confirmed a few days later, reportedly costing Apple $400 million, with media reports noting that the purchase looked like a move by Apple to get data and tools to bolster Apple Apple Music streaming service.", "arguments": {}}, {"template": "Buy", "sentence": "This is Apple's third office located within Israel; the first, also in Herzliya, was obtained as part of the Anobit acquisition, and the other is a research center in Haifa.\n\n", "arguments": {}}, {"template": "Location", "sentence": "Apple Inc. is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services.", "arguments": {"smallLoc": "Cupertino", "bigLoc": "California"}}, {"template": "Location", "sentence": "The official press release explained that Apple was \"scaling back\" on trade shows in general, including Macworld Tokyo and the Apple Expo in Paris, France, primarily because the enormous successes of the Apple Retail Stores and website had rendered trade shows a minor promotional channel.\n\n", "arguments": {"smallLoc": "the Apple Expo", "bigLoc": "France"}}, {"template": "Location", "sentence": "The official press release explained that Apple was \"scaling back\" on trade shows in general, including Macworld Tokyo and the Apple Expo in Paris, France, primarily because the enormous successes of the Apple Retail Stores and website had rendered trade shows a minor promotional channel.\n\n", "arguments": {"smallLoc": "Paris", "bigLoc": "France"}}, {"template": "Location", "sentence": "On February 4, 2014, Cook met with Abdullah Gül, the President of Turkey, in Ankara to discuss the company's involvement in the Fatih project.\n\n", "arguments": {"smallLoc": "the President", "bigLoc": "Turkey"}}, {"template": "Location", "sentence": "In June 2017, a newlywed couple took a newlywed couple wedding photos inside the then-recently opened Orchard Road Apple Store in Singapore.", "arguments": {"smallLoc": "the then-recently opened Orchard Road Apple Store", "bigLoc": "Singapore"}}, {"template": "Location", "sentence": "George Harrison\n\nHeadquarters\n\nApple Inc.'s world corporate headquarters are located in the middle of Silicon Valley, at 1–6 Infinite Loop, Cupertino, California.", "arguments": {"smallLoc": "Cupertino", "bigLoc": "California"}}, {"template": "Location", "sentence": "Apple has a satellite campus in neighboring Sunnyvale, California, where Apple houses a testing and research laboratory.", "arguments": {"smallLoc": "neighboring Sunnyvale", "bigLoc": "California"}}, {"template": "Location", "sentence": "Apple has expanded Apple campuses in Austin, Texas concurrently with building Apple Park in Cupertino.", "arguments": {"smallLoc": "Apple Park", "bigLoc": "Cupertino"}}, {"template": "Location", "sentence": "Apple has expanded Apple campuses in Austin, Texas concurrently with building Apple Park in Cupertino.", "arguments": {"smallLoc": "Austin", "bigLoc": "Texas"}}, {"template": "Location", "sentence": "its European headquarters is at Stockley Park on the outskirts of London.\n\n", "arguments": {"smallLoc": "Stockley Park", "bigLoc": "London"}}, {"template": "Location", "sentence": "In February 2015, Apple opened Apple new 180,000-square-foot headquarters in Herzliya, Israel, designed to accommodate approximately 800 employees.", "arguments": {"smallLoc": "Herzliya", "bigLoc": "Israel"}}, {"template": "Location", "sentence": "Apple has also used Apple iTunes platform to encourage donations, including, but not limited to, help the American Red Cross in the aftermath of the 2017 Central Mexico earthquake, followed by similar procedure in the aftermath of the 2011 Japan earthquake, Typhoon Haiyan in the Philippines in November 2013, and European migrant crisis in September 2015.", "arguments": {"smallLoc": "Typhoon Haiyan", "bigLoc": "the Philippines"}}, {"template": "Location", "sentence": "WWF announced the results at WWDC 2016 in San Francisco.\n", "arguments": {"smallLoc": "WWDC 2016", "bigLoc": "San Francisco"}}]}